fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненсткоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ДобавитьЭлементыФормы();
	
	ВКМ_УстановитьВидимостьЭлементов(ЭтотОбъект);
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВКМ_ВидДоговораПриИзменении");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненсткоеОбслуживание Тогда
		
		ТекущийОбъект.ВКМ_ДатаНачала			= Дата(1,1,1);
		ТекущийОбъект.ВКМ_ДатаОкончания 		= Дата(1,1,1);
		ТекущийОбъект.ВКМ_СтоимостьЧасаРаботы	= 0;
		ТекущийОбъект.ВКМ_СуммаАбонентскойПлаты	= 0;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ВидДоговораПриИзменении(ЭтотОбъект)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьЭлементыФормы()
	
	Если Элементы.Найти("ГруппаАбоненсткоеОбслуживание") = Неопределено Тогда
		ГруппаАбоненсткоеОбслуживание = Элементы.Добавить("ГруппаЭлементыАбоненсткоеОбслуживание", Тип("ГруппаФормы"), ЭтотОбъект);
		ГруппаАбоненсткоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаАбоненсткоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаАбоненсткоеОбслуживание.ОтображатьЗаголовок = Ложь;
	КонецЕсли; 
	
	Если Элементы.Найти("СуммаАбонентскоыПлаты") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскоыПлаты", Тип("ПолеФормы"), ГруппаАбоненсткоеОбслуживание);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Ежемесячная абонентская плата";
	КонецЕсли;
	
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбоненсткоеОбслуживание);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы";
	КонецЕсли;
	
	Если Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ГруппаАбоненсткоеОбслуживание );
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата начала";
	КонецЕсли;
	
	Если Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ГруппаАбоненсткоеОбслуживание );
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Дата окончания";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВКМ_УстановитьВидимостьЭлементов(Форма)
	
	Форма.Элементы.ГруппаЭлементыАбоненсткоеОбслуживание.Видимость = 
		Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненсткоеОбслуживание");
	
КонецПроцедуры
	
#КонецОбласти
